cf_billing/InformationRegisters/энргПризнакСудебнойЗадолженностиАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПризнакСудебнойЗадолженностиАбонента</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПризнакСудебнойЗадолженности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПризнакСудебнойЗадолженностиАбонента/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает признак судебной задолженности абонента.
//
// Параметры:
//  Период		-	Дата.
//  Организация	-	СправочникСсылка.Организации.
//  Район		-	СправочникСсылка.энргЗоныОтвественности.
//  МКД			-	СправочникСсылка.энргСтроения.
//  Абонент		-	СправочникСсылка.энргАбоненты.
// 
// Возвращаемое значение:
//   РезультатЗапроса.
//
Функция ПолучитьПризнакСудебнойЗадолженностиАбонента(Период, Организация, Район, МКД, Абонент)  Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПризнакСудебнойЗадолженностиАбонента(); 
		
	Запрос.УстановитьПараметр("Период", Период); 
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Район", Район); 
	Запрос.УстановитьПараметр("МКД", МКД);	
	Запрос.УстановитьПараметр("Абонент", Абонент);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат	РезультатЗапроса;
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаПризнакСудебнойЗадолженностиАбонента()
	
	Текст =
	"ВЫБРАТЬ
	|	энргПризнакСудебнойЗадолженностиАбонентаСрезПоследних.Период КАК Период,
	|	энргПризнакСудебнойЗадолженностиАбонентаСрезПоследних.Организация КАК Организация,
	|	энргПризнакСудебнойЗадолженностиАбонентаСрезПоследних.Район КАК Район,
	|	энргПризнакСудебнойЗадолженностиАбонентаСрезПоследних.Абонент КАК Абонент,
	|	энргПризнакСудебнойЗадолженностиАбонентаСрезПоследних.ПризнакСудебнойЗадолженности КАК ПризнакСудебнойЗадолженности
	|ИЗ
	|	РегистрСведений.энргПризнакСудебнойЗадолженностиАбонента.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И Район = &Район
	|				И МКД = &МКД
	|				И Абонент = &Абонент) КАК энргПризнакСудебнойЗадолженностиАбонентаСрезПоследних";
	
	Возврат Текст;
	
КонецФункции   

#КонецОбласти

#КонецЕсли
